Revit 2027 API
BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInDesignOption Property
 A pad in the main model cannot be hosted by topography in a Design Option [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConfusingPadByElementsInDesignOption { get; }
Public Shared ReadOnly Property ConfusingPadByElementsInDesignOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConfusingPadByElementsInDesignOption {
	FailureDefinitionId^ get ();
}
static member ConfusingPadByElementsInDesignOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace